# Challenge 3

In this challenge we will work on the `Orders.csv` data set in the previous [Subsetting and Descriptive Stats lab](../../lab-subsetting-and-descriptive-stats/your-code/main.ipynb). In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

# Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [1]:
# import required libraries
import numpy as np
import pandas as pd

Next, import `Orders.csv` from the "subsetting" lab folder into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [2]:
# enter your code here
orders = pd.read_csv("Orders.csv")
orders.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

In [3]:
# your code here sub 1
orders['CustomerID'] = orders['CustomerID'].apply(str)

In [4]:
orders_agg = pd.DataFrame(orders.groupby(['CustomerID','Country'])['amount_spent'].agg('sum')).reset_index()

In [5]:
orders_agg

     CustomerID         Country  amount_spent
0         12346  United Kingdom      77183.60
1         12347         Iceland       4310.00
2         12348         Finland       1797.24
3         12349           Italy       1757.55
4         12350          Norway        334.40
...         ...             ...           ...
4342      18280  United Kingdom        180.60
4343      18281  United Kingdom         80.82
4344      18282  United Kingdom        178.05
4345      18283  United Kingdom       2094.88
4346      18287  United Kingdom       1837.28

[4347 rows x 3 columns]

In [6]:
vip_q = orders_agg['amount_spent'].quantile(0.95)

In [7]:
vip_q

5774.277999999996

In [8]:
cust_vip = orders_agg[orders_agg['amount_spent']>vip_q].sort_values(by='amount_spent')

In [9]:
cust_vip

     CustomerID         Country  amount_spent
312       12720         Germany       5781.73
545       13050  United Kingdom       5836.86
900       13534  United Kingdom       5870.08
658       13209  United Kingdom       5891.61
1906      14944  United Kingdom       5900.25
...         ...             ...           ...
1888      14911            EIRE     143825.06
3017      16446  United Kingdom     168472.50
3737      17450  United Kingdom     194550.79
4210      18102  United Kingdom     259657.30
1698      14646     Netherlands     280206.02

[218 rows x 3 columns]

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

# Q2: How to identify which country has the most VIP Customers?

# Q3: How to identify which country has the most VIP+Preferred Customers combined?

Provide your solution for Q2 below:

In [10]:
# your code here
cust_vip['Country'].value_counts()
# el pais con mayor numero de clientes VIP es United Kingdom

United Kingdom     178
Germany             11
France               9
Switzerland          3
Japan                2
Portugal             2
EIRE                 2
Spain                2
Singapore            1
Australia            1
Sweden               1
Finland              1
Norway               1
Channel Islands      1
Denmark              1
Cyprus               1
Netherlands          1
Name: Country, dtype: int64

In [11]:
pref_q = orders_agg['amount_spent'].quantile(0.75)

In [12]:
pref_q

1661.195

In [13]:
cust_pref = orders_agg[orders_agg['amount_spent']<pref_q].sort_values(by='amount_spent')

In [14]:
cust_pref

     CustomerID         Country  amount_spent
693       13256  United Kingdom          0.00
3226      16738  United Kingdom          3.75
1802      14792  United Kingdom          6.20
3023      16454  United Kingdom          6.90
4107      17956  United Kingdom         12.75
...         ...             ...           ...
2569      15826  United Kingdom       1654.31
2657      15953  United Kingdom       1659.38
1260      14045  United Kingdom       1659.75
486       12967  United Kingdom       1660.90
2201      15332       Lithuania       1661.06

[3260 rows x 3 columns]

In [15]:
cust_pref['Country'].value_counts()

United Kingdom          2987
France                    58
Germany                   55
Spain                     23
Belgium                   14
Switzerland               12
Portugal                  12
Austria                   10
Italy                      9
Netherlands                8
Finland                    7
Denmark                    6
Sweden                     6
Poland                     5
Australia                  5
Channel Islands            5
Cyprus                     5
Japan                      4
USA                        4
Unspecified                4
Canada                     3
Norway                     3
Greece                     3
United Arab Emirates       2
Bahrain                    2
Saudi Arabia               1
Czech Republic             1
Israel                     1
Malta                      1
RSA                        1
Brazil                     1
European Community         1
Lithuania                  1
Name: Country, dtype: int64

In [16]:
# el pais con mas clientes preferred es united kingdom